<?php
/*
 * 在进行php开发的时候,可能会出现如下的这些情况:
 * 我想要的明明是字符串,但是对方给我传来的却是json串
 * 我想要的是用数组进行循环便利,但是这个字符串却让我很无奈
 * 好的,下面的代码就是处理这样的问题,实现
 * json<=>数组<=>字符串
 * 三者之间的互相转换
 * 注意,本文用js来实现,但其实在服务器端用php也完全可以做到
 * */
?>
<script>
    //进行json串,数组,字符串的互相之间的转换
    //a表示数组,s表示字符串,j表示json串
    /***1,数组=>字符串****/
    var a1=[1,2,3,4];
    var s1 = JSON.stringify(a1);
    console.log(a1[0]);//输出的是'1'
    console.log(s1[0]);//输出的是'['
    //很明显看出两者的区别


    /****2,字符串=>数组*****/
    var s2 = '1,2,3,4,5';//一条很常见的用都好分隔的字符串
    var a2 = s2.split(',');
    console.log(a2[1]);//输出的是'2'
    console.log(s2[1]);//输出的是','
    //注意看,下标选择的是1,同样是很明显的区别

    /*****3,数组=>json对象*****/
    var j3 = {};
    var a3=["x",1,"y",2];//注意所定义的数组格式
    for (var i=0;i<a3.length;i+=2) {
        j3[a3[i]] = a3[i+1];
    }
    console.log(j3.y);

    /*****4,json对象=>数组*******/
    var a4 = [];
    var j4 = {"a":1,"b":2,"c":3,"d":4};
    for(var k in j4){
//        a4.push(j4[k]);
        a4[k] = j4[k];//注意,在这里赋值的时候,不应该写成j4.k
    }
    console.log(a4);
    /****5,json=>json字符串******/
    var j5 = {"a":1,"b":2,"c":3,"d":4};
    var s5 = JSON.stringify(j5);
    console.log(j5);//对象
    console.log(s5);//字符串

    /****6,json字符串=>json对象*****************/
    //JSON字符串:
    var s6 = '{ "x": "1", "y": "2" }';
    var j6 = eval('(' + s6 + ')');
    console.log(j6);
    /***
     * 在这里可以注意一下json字符串和json对象的区别
     * 如下:
     */
    //JSON字符串:
    //var s6 = '{ "x": "1", "y": "2" }';
    //JSON对象:
    //var j6 = { "z": "1", "y": "2" };
    /**☆☆☆
     * 当然,json,数组,字符串三者之间的转化方式还有很多.
     * 除了上述的简单介绍外,还需要使用者认真的尝试与实践,此处不一一进行展开.
     *
     * ☆☆☆**/
</script>